# Week13 - Lab 
## Refresher

* Find averages for both genders

In [11]:
import pandas as pd 
import numpy as np

In [12]:
df = pd.read_csv('https://raw.githubusercontent.com/msaricaumbc/DS601_Fall21/main/Week13/data/ages.csv', index_col=0)

In [13]:
df.head()

   gender  age
0  Female   51
1    Male   66
2    Male   75
3  Female   72
4    Male   73

In [14]:
df.tail()

      gender  age
1995  Female   62
1996    Male   84
1997  Female   77
1998  Female   68
1999  Female   54

In [15]:
df['gender'].value_counts()

Female    773
Male      728
male      263
female    236
Name: gender, dtype: int64

In [16]:
df['gender'] = df['gender'].str.upper()

In [17]:
df['gender'].value_counts()

FEMALE    1009
MALE       991
Name: gender, dtype: int64

In [18]:
grouped = df.groupby('gender').agg(np.mean)

In [19]:
grouped

              age
gender
FEMALE  63.895937
MALE    62.265388